ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC5_PORTA(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC5_PORTB(base);
        break;
    case 2:
        retValue =  SIM_BRD_SCGC5_PORTC(base);
        break;
    case 3:
        retValue =  SIM_BRD_SCGC5_PORTD(base);
        break;
    case 4:
        retValue =  SIM_BRD_SCGC5_PORTE(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableEwmClock
 * Description   : Enable the clock for EWM module
 * This function enables the clock for EWM module.
 *
 *END**************************************************************************/
void SIM_HAL_EnableEwmClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC4_EWM(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableEwmClock
 * Description   : Disable the clock for EWM modul
 * This function disables the clock for EWM module.
 *
 *END**************************************************************************/
void SIM_HAL_DisableEwmClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC4_EWM(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetEwmGateCmd
 * Description   : Get the the clock gate state for EWM module
 * This function will get the clock gate state for EWM module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetEwmGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC4_EWM(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableFtfClock
 * Description   : Enable the clock for FTF module
 * This function enables the clock for FTF module.
 *
 *END**************************************************************************/
void SIM_HAL_EnableFtfClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_FTF(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableFtfClock
 * Description   : Disable the clock for FTF module
 * This function disables the clock for FTF module.
 *
 *END**************************************************************************/
void SIM_HAL_DisableFtfClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_FTF(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtfGateCmd
 * Description   : Get the the clock gate state for FTF module
 * This function will get the clock gate state for FTF module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetFtfGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC6_FTF(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableCrcClock
 * Description   : Enable the clock for CRC module
 * This function enables the clock for CRC module.
 *
 *END**************************************************************************/
void SIM_HAL_EnableCrcClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_CRC(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableCrcClock
 * Description   : Disable the clock for CRC module
 * This function disables the clock for CRC module.
 *
 *END**************************************************************************/
void SIM_HAL_DisableCrcClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_CRC(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetCrcGateCmd
 * Description   : Get the the clock gate state for CRC module
 * This function will get the clock gate state for CRC module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetCrcGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC6_CRC(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableAdcClock
 * Description   : Enable the clock for ADC module
 * This function enables the clock for ADC module
 *
 *END**************************************************************************/
void SIM_HAL_EnableAdcClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_ADC0(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableAdcClock
 * Description   : Disable the clock for ADC module
 * This function disables the clock for ADC module
 *
 *END**************************************************************************/
void SIM_HAL_DisableAdcClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_ADC0(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcGateCmd
 * Description   : Get the the clock gate state for ADC module
 * This function will get the clock gate state for ADC module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetAdcGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    retValue =  SIM_BRD_SCGC6_ADC0(base);
    
    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableCmpClock
 * Description   : Enable the clock for CMP module
 * This function enables the clock for CMP module
 *
 *END**************************************************************************/
void SIM_HAL_EnableCmpClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC4_CMP(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableCmpClock
 * Description   : Disable the clock for CMP module
 * This function disables the clock for CMP module
 *
 *END**************************************************************************/
void SIM_HAL_DisableCmpClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC4_CMP(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetCmpGateCmd
 * Description   : Get the the clock gate state for CMP module
 * This function will get the clock gate state for CMP module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetCmpGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC4_CMP(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableDacClock
 * Description   : Enable the clock for DAC module
 * This function enables the clock for DAC module
 *
 *END**************************************************************************/
void SIM_HAL_EnableDacClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_DAC0(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableDacClock
 * Description   : Disable the clock for DAC module
 * This function disables the clock for DAC module
 *
 *END**************************************************************************/
void SIM_HAL_DisableDacClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_DAC0(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetDacGateCmd
 * Description   : Get the the clock gate state for DAC module
 * This function will get the clock gate state for DAC module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetDacGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    retValue =  SIM_BRD_SCGC6_DAC0(base);

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnablePdbClock
 * Description   : Enable the clock for PDB module
 * This function enables the clock for PDB module
 *
 *END**************************************************************************/
void SIM_HAL_EnablePdbClock(SIM_Type* base, uint32_t instance)
{
    switch(instance)
    {
        case 0:
            SIM_BWR_SCGC6_PDB0(base, 1);
            break;
        case 1:
            SIM_BWR_SCGC6_PDB1(base, 1);
            break;
        default: break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisablePdbClock
 * Description   : Disable the clock for PDB module
 * This function disables the clock for PDB module
 *
 *END**************************************************************************/
void SIM_HAL_DisablePdbClock(SIM_Type* base, uint32_t instance)
{
    switch(instance)
    {
        case 0:
            SIM_BWR_SCGC6_PDB0(base, 0);
            break;
        case 1:
            SIM_BWR_SCGC6_PDB1(base, 0);
            break;
        default: break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetPdbGateCmd
 * Description   : Get the the clock gate state for PDB module
 * This function will get the clock gate state for PDB module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetPdbGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;
    
    switch(instance)
    {
        case 0:
            retValue = SIM_BRD_SCGC6_PDB0(base);
            break;
        case 1:
            retValue = SIM_BRD_SCGC6_PDB1(base);
            break;
        default: break;
    }
    
    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableFtmClock
 * Description   : Enable the clock for FTM module
 * This function enables the clock for FTM module
 *
 *END**************************************************************************/
void SIM_HAL_EnableFtmClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC6_FTM0(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC6_FTM1(base, 1);
        break;
    case 2:
        SIM_BWR_SCGC6_FTM2(base, 1);
        break;
    case 3:
        SIM_BWR_SCGC6_FTM3(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableFtmClock
 * Description   : Disable the clock for FTM module
 * This function disables the clock for FTM module
 *
 *END**************************************************************************/
void SIM_HAL_DisableFtmClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC6_FTM0(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC6_FTM1(base, 0);
        break;
    case 2:
        SIM_BWR_SCGC6_FTM2(base, 0);
        break;
    case 3:
        SIM_BWR_SCGC6_FTM3(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmGateCmd
 * Description   : Get the the clock gate state for FTM module
 * This function will get the clock gate state for FTM module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetFtmGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

