ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG0(base);
        break;
    case 1:
        retValue =  SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG1(base);
        break;
    case 2:
        retValue =  SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG2(base);
        break;
    case 3:
        retValue =  SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG3(base);
        break;
    default:
        retValue =  false;
        break;
    }
    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableSyncXbarBPittrigX
 * Description   : Synchronize XBARB's Input PIT Trigger X with fast clock
 * This function controls the synchronizer between PIT trigger X and XBARB's input.
 *
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarBPittrigX(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_MISCTRL1_SYNCXBARBPITTRIG0(base, 1);
        break;
    case 1:
        SIM_BWR_MISCTRL1_SYNCXBARBPITTRIG1(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableSyncXbarBPittrigX
 * Description   : Disable the synchronizer between PIT trigger X and XBARB's input
 * This function Disables the synchronizer between PIT trigger X and XBARB's input
 *
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarBPittrigX(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_MISCTRL1_SYNCXBARBPITTRIG0(base, 0);
        break;
    case 1:
        SIM_BWR_MISCTRL1_SYNCXBARBPITTRIG1(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetSyncXbarBPittrigXcmd
 * Description   : Get the synchronizer cmd between PIT trigger X and XBARB's input
 *
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarBPittrigXcmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_MISCTRL1_SYNCXBARBPITTRIG0(base);
        break;
    case 1:
        retValue =  SIM_BRD_MISCTRL1_SYNCXBARBPITTRIG1(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableSyncXbarDac
 * Description   : Synchronize XBARA's output for DAC Hardware Trigger with flash/slow clock
 * This function controls the synchronizer between XBARA's output and DAC hardware trigger.
 *
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarDac(SIM_Type* base)
{
    SIM_BWR_MISCTRL1_SYNCDACHWTRIG(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableSyncXbarDac
 * Description   : Disable  the synchronizer  between XBARA's output and DAC hardware trigger
 * This function Disables  the synchronizer  between XBARA's output and DAC hardware trigger
 *
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarDac(SIM_Type* base)
{
    SIM_BWR_MISCTRL1_SYNCDACHWTRIG(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetSyncXbarDaccmd
 * Description   : Get the synchronizer cmd between XBARA's output  and DAC hardware trigger
 *
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarDaccmd(SIM_Type* base)
{
    return  (bool)SIM_BRD_MISCTRL1_SYNCDACHWTRIG(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableSyncXbarEwmin
 * Description   : Enable the synchronizer  between XBARA's output and EWM's ewm_in
 * This function enables the synchronizer between XBARA's output and EWM's ewm_in
 *
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarEwmin(SIM_Type* base)
{
        SIM_BWR_MISCTRL1_SYNCEWMIN(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableSyncXbarEwmin
 * Description   : Disable  the synchronizer  between XBARA's output and EWM's ewm_in
 * This function Disables  the synchronizer  between XBARA's output and EWM's ewm_in
 *
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarEwmin(SIM_Type* base)
{
  SIM_BWR_MISCTRL1_SYNCEWMIN(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetSyncXbarEwmincmd
 * Description   : Get the synchronizer cmd between XBARA's output  and EWM's ewm_in
 *
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarEwmincmd(SIM_Type* base)
{
    return  (bool)SIM_BRD_MISCTRL1_SYNCEWMIN(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableSyncXbarCmpX
 * Description   : Enable the the synchronizer between XBARA's output and CMP3's sample/window input
 * This function enables the the synchronizer between XBARA's output and CMP3's sample/window input
 *
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarCmpX(SIM_Type* base, uint32_t instance)
{
  assert (instance < CMP_INSTANCE_COUNT);
    switch (instance)
    {
    case 0:
        SIM_BWR_MISCTRL1_SYNCCMP0SAMPLEWIN(base, 1);
        break;
    case 1:
        SIM_BWR_MISCTRL1_SYNCCMP1SAMPLEWIN(base, 1);
        break;
    case 2:
        SIM_BWR_MISCTRL1_SYNCCMP2SAMPLEWIN(base, 1);
        break;
    case 3:
        SIM_BWR_MISCTRL1_SYNCCMP3SAMPLEWIN(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableSyncXbarCmpX
 * Description   : Disable the synchronizer between XBARA's output and CMP3's sample/window input
 * This function Disables the synchronizer between XBARA's output and CMP3's sample/window input
 *
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarCmpX(SIM_Type* base, uint32_t instance)
{
  assert (instance < CMP_INSTANCE_COUNT);
    switch (instance)
    {
    case 0:
        SIM_BWR_MISCTRL1_SYNCCMP0SAMPLEWIN(base, 0);
        break;
    case 1:
        SIM_BWR_MISCTRL1_SYNCCMP1SAMPLEWIN(base, 0);
        break;
    case 2:
        SIM_BWR_MISCTRL1_SYNCCMP2SAMPLEWIN(base, 0);
        break;
    case 3:
        SIM_BWR_MISCTRL1_SYNCCMP3SAMPLEWIN(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetSyncXbarCmpXcmd
 * Description   : Get the synchronizer cmd between XBARA's output and CMP3's sample/window input
 *
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarCmpXcmd(SIM_Type* base, uint32_t instance)
{
  assert (instance < CMP_INSTANCE_COUNT);
    bool retValue = false;

