ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
    switch (instance)
    {
    case 1:
        switch (channel)
        {
        case 0:
            SIM_BWR_SOPT9_FTM1ICH0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT9_FTM1ICH1SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (channel)
        {
        case 0:
            SIM_BWR_SOPT9_FTM2ICH0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT9_FTM2ICH1SRC(base, select);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmChSrcMode
 * Description   : Get FlexTimer x channel y input capture source select setting
 * This function will get FlexTimer x channel y input capture source select
 * setting.
 *
 *END**************************************************************************/
sim_ftm_ch_src_t SIM_HAL_GetFtmChSrcMode(SIM_Type* base,
                                         uint32_t instance,
                                         uint8_t channel)
{
    sim_ftm_ch_src_t retValue = (sim_ftm_ch_src_t)false;

    assert (instance < FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 1:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT9_FTM1ICH0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT9_FTM1ICH1SRC(base);
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT9_FTM2ICH0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT9_FTM2ICH1SRC(base);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmChOutSrcMode
 * Description   : FlexTimer x channel y output source select setting.
 * This function will select FlexTimer x channel y output source
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmChOutSrcMode(SIM_Type* base,
                                uint32_t instance,
                                uint8_t channel,
                                sim_ftm_ch_out_src_t select)
{
    switch(instance)
    {
    case 0:
      switch(channel)
          {
          case 0:
            SIM_BWR_SOPT8_FTM0OCH0SRC(base, select);
            break;
          case 1:
            SIM_BWR_SOPT8_FTM0OCH1SRC(base, select);
            break;  
          case 2:
            SIM_BWR_SOPT8_FTM0OCH2SRC(base, select);
            break;
          case 3:
            SIM_BWR_SOPT8_FTM0OCH3SRC(base, select);
            break;
          case 4:
            SIM_BWR_SOPT8_FTM0OCH4SRC(base, select);
            break;  
          case 5:
            SIM_BWR_SOPT8_FTM0OCH5SRC(base, select);
            break;
          case 6:
            SIM_BWR_SOPT8_FTM0OCH6SRC(base, select);
            break;
          case 7:
            SIM_BWR_SOPT8_FTM0OCH7SRC(base, select);
            break;  
          default:
            break;
          }
          break;
    case 3:
      switch(channel)
          {
          case 0:
            SIM_BWR_SOPT8_FTM3OCH0SRC(base, select);
            break;
          case 1:
            SIM_BWR_SOPT8_FTM3OCH1SRC(base, select);
            break;  
          case 2:
            SIM_BWR_SOPT8_FTM3OCH2SRC(base, select);
            break;
          case 3:
            SIM_BWR_SOPT8_FTM3OCH3SRC(base, select);
            break;
          case 4:
            SIM_BWR_SOPT8_FTM3OCH4SRC(base, select);
            break;  
          case 5:
            SIM_BWR_SOPT8_FTM3OCH5SRC(base, select);
            break;
          case 6:
            SIM_BWR_SOPT8_FTM3OCH6SRC(base, select);
            break;
          case 7:
            SIM_BWR_SOPT8_FTM3OCH7SRC(base, select);
            break;
          default:
            break;
          }
          break;
    default:
      break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmChOutSrcMode
 * Description   : Get FlexTimer x channel y output source select setting
 * This function will get FlexTimer x channel y output source select
 * setting.
 *
 *END**************************************************************************/
sim_ftm_ch_out_src_t SIM_HAL_GetFtmChOutSrcMode(SIM_Type* base,
                                                uint32_t instance,
                                                uint8_t channel)
{
  sim_ftm_ch_out_src_t retValue = (sim_ftm_ch_out_src_t) false;
  switch(instance)
    {
    case 0:
      switch(channel)
          {
          case 0:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH0SRC(base);
            break;
          case 1:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH1SRC(base);
            break;  
          case 2:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH2SRC(base);
            break;
          case 3:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH3SRC(base);
            break;
          case 4:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH4SRC(base);
            break;  
          case 5:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH5SRC(base);
            break;
          case 6:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH6SRC(base);
            break;
          case 7:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH7SRC(base);
            break;  
          default:
            retValue = (sim_ftm_ch_out_src_t) false;
            break;
          }
          break;
    case 3:
      switch(channel)
          {
          case 0:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH0SRC(base);
            break;
          case 1:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH1SRC(base);
            break;  
          case 2:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH2SRC(base);
            break;
          case 3:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH3SRC(base);
            break;
          case 4:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH4SRC(base);
            break;  
          case 5:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH5SRC(base);
            break;
          case 6:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH6SRC(base);
            break;
          case 7:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM3OCH7SRC(base);
            break;  
          default:
            retValue = (sim_ftm_ch_out_src_t) false;
            break;
          }
          break;
    default:
      retValue = (sim_ftm_ch_out_src_t) false;
      break;
    }
  return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmCarrierFreqCmd
 * Description   : Set FTMxCFSELBIT
 * This function sets FlexTimer x carrier frequency selection software configuration setting.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmCarrierFreqCmd(SIM_Type* base, uint32_t instance, bool ftmcarrierfreqsrc)
{
    assert (instance < FTM_INSTANCE_COUNT);
    switch(instance)
    {
    case 0:
      SIM_BWR_SOPT8_FTM0CFSEL(base,ftmcarrierfreqsrc);
      break;
    case 3:
      SIM_BWR_SOPT8_FTM3CFSEL(base,ftmcarrierfreqsrc);
      break;
    default:
      break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmCarrierFreqCmd
 * Description   : Get FlexTimer x carrier frequency selection software configuration setting.
 *
 *END**************************************************************************/
bool SIM_HAL_GetFtmCarrierFreqCmd(SIM_Type* base, uint32_t instance)
{
  bool retValue = false;
   assert (instance < FTM_INSTANCE_COUNT);
    switch(instance)
    {
    case 0:
      retValue = SIM_BRD_SOPT8_FTM0CFSEL(base);
      break;
    case 3:
      retValue = SIM_BRD_SOPT8_FTM3CFSEL(base);
      break;
    default:
      retValue = false;
      break;
    }
    return retValue;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmSyncCmd
 * Description   : Set FTMxSYNCBIT
 * This function sets FlexTimer x hardware trigger 0 software synchronization.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmSyncCmd(SIM_Type* base, uint32_t instance, bool sync)
{
    assert (instance < FTM_INSTANCE_COUNT);
    if (sync)
    {
        SIM_SET_SOPT8(base, (1U<<instance));
    }
    else
    {
        SIM_CLR_SOPT8(base, (1U<<instance));
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetHsadcAlternativeTriggerMode
 * Description   : Set HSADCx alternate trigger select setting
 * This function will enable/disable alternative conversion triggers for HSADCx.
 *
 *END**************************************************************************/
void SIM_HAL_SetHsadcAlternativeTriggerMode(SIM_Type* base,
	                                        uint32_t instance,
											sim_hsadc_conv_id_t convId,
											sim_hsadc_alttrg_sel_t select)
{
    assert(instance < HSADC_INSTANCE_COUNT);

