ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
    switch (instance)
    {
    case 0:
        switch (convId)
        {
        case kSimHsadcConvA:
            SIM_BWR_SOPT7_HSADC0AALTTRGEN(base, select);
            break;
        case kSimHsadcConvB:
            SIM_BWR_SOPT7_HSADC0BALTTRGEN(base, select);
            break;
        default:
            break;
        }
        break;
    case 1:
        switch (convId)
        {
        case kSimHsadcConvA:
            SIM_BWR_SOPT7_HSADC1AALTTRGEN(base, select);
            break;
        case kSimHsadcConvB:
            SIM_BWR_SOPT7_HSADC1BALTTRGEN(base, select);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetHsadcAlternativeTriggerMode
 * Description   : Get HSADCx alternate trigger select setting
 * This function will get HSADCx alternate trigger enable setting.
 *
 *END**************************************************************************/
sim_hsadc_alttrg_sel_t SIM_HAL_GetHsadcAlternativeTriggerMode(SIM_Type* base,
	                                                          uint32_t instance,
															  sim_hsadc_conv_id_t convId)
{
    sim_hsadc_alttrg_sel_t retValue = (sim_hsadc_alttrg_sel_t)0;

    assert(instance < HSADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        switch (convId)
        {
        case kSimHsadcConvA:
            retValue = (sim_hsadc_alttrg_sel_t)SIM_BRD_SOPT7_HSADC0AALTTRGEN(base);
            break;
        case kSimHsadcConvB:
            retValue = (sim_hsadc_alttrg_sel_t)SIM_BRD_SOPT7_HSADC0BALTTRGEN(base);
            break;
        default:
            break;
        }
        break;
    case 1:
        switch (convId)
        {
        case kSimHsadcConvA:
            retValue = (sim_hsadc_alttrg_sel_t)SIM_BRD_SOPT7_HSADC1AALTTRGEN(base);
            break;
        case kSimHsadcConvB:
            retValue = (sim_hsadc_alttrg_sel_t)SIM_BRD_SOPT7_HSADC1BALTTRGEN(base);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcAlternativeTriggerMode
 * Description   : Sets the ADCx alternate trigger select setting
 * This function selects the alternative conversion triggers for ADCx
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcAlternativeTriggerMode(SIM_Type * base,
                                         uint32_t instance,
                                         sim_adc_alttrg_sel_t select)
{
    assert(instance < ADC_INSTANCE_COUNT);

    SIM_BWR_ADCOPT_ADC0ALTTRGEN(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcAlternativeTriggerMode
 * Description   : Gets the ADCx alternate trigger select setting
 * This function gets the ADCx alternate trigger select setting
 *
 *END**************************************************************************/
sim_adc_alttrg_sel_t SIM_HAL_GetAdcAlternativeTriggerMode(SIM_Type * base,
                                                  uint32_t instance)
{
    assert(instance < ADC_INSTANCE_COUNT);

    return (sim_adc_alttrg_sel_t)SIM_BRD_ADCOPT_ADC0ALTTRGEN(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcPreTriggerMode
 * Description   : Set ADCx pre-trigger select setting
 * This function will select the ADCx pre-trigger source when alternative
 * triggers are enabled through ADCxALTTRGEN
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcPreTriggerMode(SIM_Type * base,
                                  uint32_t instance,
                                  sim_adc_pretrg_sel_t select)
{
    assert(instance < ADC_INSTANCE_COUNT);

    SIM_BWR_ADCOPT_ADC0PRETRGSEL(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcPreTriggerMode
 * Description   : Get ADCx pre-trigger select setting
 * This function will get ADCx pre-trigger select setting.
 *
 *END**************************************************************************/
sim_adc_pretrg_sel_t SIM_HAL_GetAdcPreTriggerMode(SIM_Type * base,
                                                  uint32_t instance)
{
    assert(instance < ADC_INSTANCE_COUNT);

    return (sim_adc_pretrg_sel_t)SIM_BRD_ADCOPT_ADC0PRETRGSEL(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetHsadcTriggerMode
 * Description   : Set HSADCx trigger select setting
 * This function will select the HSADCx trigger source when alternative triggers
 * are enabled through HSADCxALTTRGEN
 *
 *END**************************************************************************/
void SIM_HAL_SetHsadcTriggerMode(SIM_Type* base,
	                             uint32_t instance,
								 sim_hsadc_conv_id_t convId,
								 sim_hsadc_trg_sel_t select)
{
    assert(instance < HSADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        switch (convId)
        {
        case kSimHsadcConvA:
            SIM_BWR_SOPT7_HSADC0ATRGSEL(base, select);
            break;
        case kSimHsadcConvB:
            SIM_BWR_SOPT7_HSADC0BTRGSEL(base, select);
            break;
        default:
            break;
        }
        break;
    case 1:
        switch (convId)
        {
        case kSimHsadcConvA:
            SIM_BWR_SOPT7_HSADC1ATRGSEL(base, select);
            break;
        case kSimHsadcConvB:
            SIM_BWR_SOPT7_HSADC1BTRGSEL(base, select);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetHsadcTriggerMode
 * Description   : Get HSADCx trigger select setting
 * This function will get HSADCx trigger select setting.
 *
 *END**************************************************************************/
sim_hsadc_trg_sel_t SIM_HAL_GetHsadcTriggerMode(SIM_Type* base,
	                                            uint32_t instance,
												sim_hsadc_conv_id_t convId)
{
    sim_hsadc_trg_sel_t retValue = (sim_hsadc_trg_sel_t)0;

