ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
    switch (instance)
    {
    case 0:
        switch (fault)
        {
        case 0:
            SIM_BWR_SOPT4_FTM0FLT0(base, select);
            break;
        case 1:
            SIM_BWR_SOPT4_FTM0FLT1(base, select);
            break;
        case 2:
            SIM_BWR_SOPT4_FTM0FLT2(base, select);
            break;
        case 3:
            SIM_BWR_SOPT4_FTM0FLT3(base, select);
            break;
        default:
            break;
        }
        break;
    case 1:
        SIM_BWR_SOPT4_FTM1FLT0(base, select);
        break;
    case 2:
        SIM_BWR_SOPT4_FTM2FLT0(base, select);
        break;
    case 3:
        SIM_BWR_SOPT4_FTM3FLT0(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmFaultSelMode
 * Description   : Get FlexTimer x fault y select setting
 * This function will get FlexTimer x fault y select setting.
 *
 *END**************************************************************************/
sim_ftm_flt_sel_t SIM_HAL_GetFtmFaultSelMode(SIM_Type* base,
                                             uint8_t instance,
                                             uint8_t fault)
{
    sim_ftm_flt_sel_t retValue = (sim_ftm_flt_sel_t)0;

    assert (instance < FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        switch (fault)
        {
        case 0:
            retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM0FLT0(base);
            break;
        case 1:
            retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM0FLT1(base);
            break;
        case 2:
            retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM0FLT2(base);
            break;
        case 3:
            retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM0FLT3(base);
            break;    
        default:
            break;
        }
        break;
    case 1:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM1FLT0(base);
        break;
    case 2:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM2FLT0(base);
        break;
    case 3:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM3FLT0(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnablePitClock
 * Description   : Enable the clock for PIT module
 * This function enables the clock for PIT module
 *
 *END**************************************************************************/
void SIM_HAL_EnablePitClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_PIT(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisablePitClock
 * Description   : Disable the clock for PIT module
 * This function disables the clock for PIT module
 *
 *END**************************************************************************/
void SIM_HAL_DisablePitClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC6_PIT(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetPitGateCmd
 * Description   : Get the the clock gate state for PIT module
 * This function will get the clock gate state for PIT module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetPitGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC6_PIT(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableLptmrClock
 * Description   : Enable the clock for LPTIMER module
 * This function enables the clock for LPTIMER module
 *
 *END**************************************************************************/
void SIM_HAL_EnableLptmrClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_LPTMR(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableLptmrClock
 * Description   : Disable the clock for LPTIMER module
 * This function disables the clock for LPTIMER module
 *
 *END**************************************************************************/
void SIM_HAL_DisableLptmrClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_LPTMR(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetLptmrGateCmd
 * Description   : Get the the clock gate state for LPTIMER module
 * This function will get the clock gate state for LPTIMER module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetLptmrGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC5_LPTMR(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableFlexcanClock
 * Description   : Enable the clock for FLEXCAN module
 * This function enables the clock for FLEXCAN module
 *
 *END**************************************************************************/
void SIM_HAL_EnableFlexcanClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC6_FLEXCAN0(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC6_FLEXCAN1(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableFlexcanClock
 * Description   : Disable the clock for FLEXCAN module
 * This function disables the clock for FLEXCAN module
 *
 *END**************************************************************************/
void SIM_HAL_DisableFlexcanClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC6_FLEXCAN0(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC6_FLEXCAN1(base, 0);
        break;
    default:
        break;
    }
    
