ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFlexcanGateCmd
 * Description   : Get the the clock gate state for FLEXCAN module
 * This function will get the clock gate state for FLEXCAN module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetFlexcanGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC6_FLEXCAN0(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC6_FLEXCAN1(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableSpiClock
 * Description   : Enable the clock for SPI module
 * This function enables the clock for SPI module
 *
 *END**************************************************************************/
void SIM_HAL_EnableSpiClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC6_SPI0(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC6_SPI1(base, 1);
        break;
    case 2:
        SIM_BWR_SCGC3_SPI2(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableSpiClock
 * Description   : Disable the clock for SPI module
 * This function disables the clock for SPI module
 *
 *END**************************************************************************/
void SIM_HAL_DisableSpiClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC6_SPI0(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC6_SPI1(base, 0);
        break;
    case 2:
        SIM_BWR_SCGC3_SPI2(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetSpiGateCmd
 * Description   : Get the the clock gate state for SPI module
 * This function will get the clock gate state for SPI module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetSpiGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC6_SPI0(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC6_SPI1(base);
        break;
    case 2:
        retValue =  SIM_BRD_SCGC3_SPI2(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableI2cClock
 * Description   : Enable the clock for I2C module
 * This function enables the clock for I2C module
 *
 *END**************************************************************************/
void SIM_HAL_EnableI2cClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC4_I2C0(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC4_I2C1(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableI2cClock
 * Description   : Disable the clock for I2C module
 * This function disables the clock for I2C module
 *
 *END**************************************************************************/
void SIM_HAL_DisableI2cClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC4_I2C0(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC4_I2C1(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetI2cGateCmd
 * Description   : Get the the clock gate state for I2C module
 * This function will get the clock gate state for I2C module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetI2cGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC4_I2C0(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC4_I2C1(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableUartClock
 * Description   : Enable the clock for UART module
 * This function enables the clock for UART module
 *
 *END**************************************************************************/
void SIM_HAL_EnableUartClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC4_UART0(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC4_UART1(base, 1);
        break;
    case 2:
        SIM_BWR_SCGC4_UART2(base, 1);
        break;
    case 3:
        SIM_BWR_SCGC4_UART3(base, 1);
        break;
    case 4:
        SIM_BWR_SCGC1_UART4(base, 1);
        break;
    case 5:
        SIM_BWR_SCGC1_UART5(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableUartClock
 * Description   : Disable the clock for UART module
 * This function disables the clock for UART module
 *
 *END**************************************************************************/
void SIM_HAL_DisableUartClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC4_UART0(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC4_UART1(base, 0);
        break;
    case 2:
        SIM_BWR_SCGC4_UART2(base, 0);
        break;
    case 3:
        SIM_BWR_SCGC4_UART3(base, 0);
        break;
    case 4:
        SIM_BWR_SCGC1_UART4(base, 0);
        break;
    case 5:
        SIM_BWR_SCGC1_UART5(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartGateCmd
 * Description   : Get the the clock gate state for UART module
 * This function will get the clock gate state for UART module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetUartGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

