ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC4_UART0(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC4_UART1(base);
        break;
    case 2:
        retValue =  SIM_BRD_SCGC4_UART2(base);
        break;
    case 3:
        retValue =  SIM_BRD_SCGC4_UART3(base);
        break;
    case 4:
        retValue =  SIM_BRD_SCGC1_UART4(base);
        break;
    case 5:
        retValue =  SIM_BRD_SCGC1_UART5(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnablePwmClock
 * Description   : Enable the clock for eFlexPWM module
 * This function enables the clock for eFlexPWM module
 *
 *END**************************************************************************/
void SIM_HAL_EnablePwmClock(SIM_Type* base, uint32_t instance, uint8_t channel)
{
	switch (instance)
	{
	case 0:
		switch (channel)
		{
		case 0:
			SIM_BWR_SCGC4_PWM0_SM0(base, 1);
			break;
		case 1:
			SIM_BWR_SCGC4_PWM0_SM1(base, 1);
			break;
		case 2:
			SIM_BWR_SCGC4_PWM0_SM2(base, 1);
			break;
		case 3:
			SIM_BWR_SCGC4_PWM0_SM3(base, 1);
			break;
		default:
			break;
		}
		break;
	case 1:
		switch (channel)
		{
		case 0:
			SIM_BWR_SCGC1_PWM1_SM0(base, 1);
			break;
		case 1:
			SIM_BWR_SCGC1_PWM1_SM1(base, 1);
			break;
		case 2:
			SIM_BWR_SCGC1_PWM1_SM2(base, 1);
			break;
		case 3:
			SIM_BWR_SCGC1_PWM1_SM3(base, 1);
			break;
		default:
			break;
		}
		break;
	default:
		break;
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisablePwmClock
 * Description   : Disable the clock for eFlexPWM module
 * This function disables the clock for eFlexPWM module
 *
 *END**************************************************************************/
void SIM_HAL_DisablePwmClock(SIM_Type* base, uint32_t instance, uint8_t channel)
{
	switch (instance)
	{
	case 0:
		switch (channel)
		{
		case 0:
			SIM_BWR_SCGC4_PWM0_SM0(base, 0);
			break;
		case 1:
			SIM_BWR_SCGC4_PWM0_SM1(base, 0);
			break;
		case 2:
			SIM_BWR_SCGC4_PWM0_SM2(base, 0);
			break;
		case 3:
			SIM_BWR_SCGC4_PWM0_SM3(base, 0);
			break;
		default:
			break;
		}
		break;
	case 1:
		switch (channel)
		{
		case 0:
			SIM_BWR_SCGC1_PWM1_SM0(base, 0);
			break;
		case 1:
			SIM_BWR_SCGC1_PWM1_SM1(base, 0);
			break;
		case 2:
			SIM_BWR_SCGC1_PWM1_SM2(base, 0);
			break;
		case 3:
			SIM_BWR_SCGC1_PWM1_SM3(base, 0);
			break;
		default:
			break;
		}
		break;
	default:
		break;
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetPwmGateCmd
 * Description   : Get the the clock gate state for eFlexPWM module
 * This function will get the clock gate state for eFlexPWM module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetPwmGateCmd(SIM_Type* base, uint32_t instance, uint8_t channel)
{
    bool retValue = false;

	switch (instance)
	{
	case 0:
		switch (channel)
		{
		case 0:
			retValue =  SIM_BRD_SCGC4_PWM0_SM0(base);
			break;
		case 1:
			retValue =  SIM_BRD_SCGC4_PWM0_SM1(base);
			break;
		case 2:
			retValue =  SIM_BRD_SCGC4_PWM0_SM2(base);
			break;
		case 3:
			retValue =  SIM_BRD_SCGC4_PWM0_SM3(base);
			break;
		default:
			break;
		}
		break;
	case 1:
		switch (channel)
		{
		case 0:
			retValue =  SIM_BRD_SCGC1_PWM1_SM0(base);
			break;
		case 1:
			retValue =  SIM_BRD_SCGC1_PWM1_SM1(base);
			break;
		case 2:
			retValue =  SIM_BRD_SCGC1_PWM1_SM2(base);
			break;
		case 3:
			retValue =  SIM_BRD_SCGC1_PWM1_SM3(base);
			break;
		default:
			break;
		}
		break;
	default:
		break;
	}

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableAoiClock
 * Description   : Enable the clock for AOI module
 * This function enables the clock for AOI module
 *
 *END**************************************************************************/
void SIM_HAL_EnableAoiClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_AOI(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableAoiClock
 * Description   : Disable the clock for AOI module
 * This function disables the clock for AOI module
 *
 *END**************************************************************************/
void SIM_HAL_DisableAoiClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_AOI(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAoiGateCmd
 * Description   : Get the the clock gate state for AOI module
 * This function will get the clock gate state for AOI module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetAoiGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC5_AOI(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableXbarClock
 * Description   : Enable the clock for XBAR module
 * This function enables the clock for XBAR module
 *
 *END**************************************************************************/
void SIM_HAL_EnableXbarClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC5_XBARA(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC5_XBARB(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableXbarClock
 * Description   : Disable the clock for XBAR module
 * This function disables the clock for XBAR module
 *
 *END**************************************************************************/
void SIM_HAL_DisableXbarClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC5_XBARA(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC5_XBARB(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetXbarGateCmd
 * Description   : Get the the clock gate state for XBAR module
 * This function will get the clock gate state for XBAR module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetXbarGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

