ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.c
    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC5_XBARA(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC5_XBARB(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableEncClock
 * Description   : Enable the clock for ENC module
 * This function enables the clock for ENC module
 *
 *END**************************************************************************/
void SIM_HAL_EnableEncClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_ENC(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableEncClock
 * Description   : Disable the clock for ENC module
 * This function disables the clock for ENC module
 *
 *END**************************************************************************/
void SIM_HAL_DisableEncClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_ENC(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetEncGateCmd
 * Description   : Get the the clock gate state for ENC module
 * This function will get the clock gate state for ENC module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetEncGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC5_ENC(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnablFlexbusClock
 * Description   : Enable the clock for FLEXBUS module
 * This function enables the clock for FLEXBUS module
 *
 *END**************************************************************************/
void SIM_HAL_EnableFlexbusClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC7_FLEXBUS(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableFlexbusClock
 * Description   : Disable the clock for FLEXBUS module
 * This function disables the clock for FLEXBUS module
 *
 *END**************************************************************************/
void SIM_HAL_DisableFlexbusClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC7_FLEXBUS(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFlexbusGateCmd
 * Description   : Get the the clock gate state for FLEXBUS module
 * This function will get the clock gate state for FLEXBUS module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetFlexbusGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC7_FLEXBUS(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableHsadcClock
 * Description   : Enable the clock for HSADC module
 * This function enables the clock for HSADC module
 *
 *END**************************************************************************/
void SIM_HAL_EnableHsadcClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC5_HSADC0(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC2_HSADC1(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableHsadcClock
 * Description   : Disable the clock for HSADC module
 * This function disables the clock for HSADC module
 *
 *END**************************************************************************/
void SIM_HAL_DisableHsadcClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC5_HSADC0(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC2_HSADC1(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetHsadcGateCmd
 * Description   : Get the the clock gate state for HSADC module
 * This function will get the clock gate state for HSADC module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetHsadcGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC5_HSADC0(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC2_HSADC1(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableEnetClock
 * Description   : Enable the clock for ENET module
 * This function enables the clock for ENET module
 *
 *END**************************************************************************/
void SIM_HAL_EnableEnetClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC2_ENET(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableEnetClock
 * Description   : Disable the clock for ENET module
 * This function disables the clock for ENET module
 *
 *END**************************************************************************/
void SIM_HAL_DisableEnetClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC2_ENET(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetEnetGateCmd
 * Description   : Get the the clock gate state for ENET module
 * This function will get the clock gate state for ENET module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetEnetGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC2_ENET(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableMpuClock
 * Description   : Enable the clock for MPU module
 * This function enables the clock for MPU module
 *
 *END**************************************************************************/
void SIM_HAL_EnableMpuClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC7_SMPU(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableMpuClock
 * Description   : Disable the clock for MPU module
 * This function disables the clock for MPU module
 *
 *END**************************************************************************/
void SIM_HAL_DisableMpuClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC7_SMPU(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetMpuGateCmd
 * Description   : Get the the clock gate state for MPU module
 * This function will get the clock gate state for MPU module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetMpuGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC7_SMPU(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableTrngClock
 * Description   : Enable the clock for TRNG module
 * This function enables the clock for TRNG module
 *
 *END**************************************************************************/
void SIM_HAL_EnableTrngClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC3_TRNG(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableTrngClock
 * Description   : Disable the clock for TRNG module
 * This function disables the clock for TRNG module
 *
 *END**************************************************************************/
void SIM_HAL_DisableTrngClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC3_TRNG(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetTrngGateCmd
 * Description   : Get the the clock gate state for TRNG module
 * This function will get the clock gate state for TRNG module.
 *
 *END**************************************************************************/
bool SIM_HAL_GetTrngGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC3_TRNG(base);
}
/*******************************************************************************
 * EOF
 ******************************************************************************/

